package ecode

// Init ecode
func Init() {
	Register(map[int]string{
		0:    "请求成功",
		-3:   "API校验密匙错误",
		-5:   "参数错误",
		-101: "账号未登录",
		-400: "请求参数错误",
		-401: "未认证",
		-403: "访问权限不足",
		-404: "不存在该参数实体",
		-500: "服务器错误",
		-503: "过载保护服务暂不可用",
		-504: "服务调用超时",
		-509: "超出限制",
		-658: "Token过期",
		-659: "存在关联关系不能删除",

		-10000: "已存在盒子",
		-10001: "不存在盒子",
		-10002: "盒子未上线",
		-10003: "已存在订单号",
		-10004: "盒子存在未处理任务",
		-10005: "订单信息下载异常",
		-10006: "屏幕异常",
		-10007: "电量异常",

		-11000: "已存在基站",
		-11001: "不存在基站",
		-11002: "已存在基站配置名称",
		-11003: "基站已经停止传达盒子工作任务",
		-11004: "基站网络异常",
		-11005: "基站正在配置或者已经配置失败，无法继续执行该指令",
		-11006: "基站正在更新或者已经升级失败，无法继续执行该指令",

		-12001: "不存在该硬件本身版本",
		-12002: "不存在存放在该硬件的盒子版本",
		-12003: "上传的固件非官方固件",

		-13001: "不存在流程",
		-13002: "已存在流程名称",
	})
}
